openfoam/case_template_supersonic/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// ============================================================================

// ISA @ 15000 m: T = 216.65 K
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 216.65;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 216.65;
    }

    outlet
    {
        type            zeroGradient;
    }

    farfield_top
    {
        type            freestream;
        freestreamValue uniform 216.65;
    }

    farfield_bottom { $farfield_top; }
    farfield_sides  { $farfield_top; }

    uav_wall
    {
        // Adiabatic wall (zero heat flux)
        // Switch to fixedValue for isothermal: value uniform 300; // [K]
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetryPlane;
    }
}
