openfoam/case_template_supersonic/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// ============================================================================

// omega = sqrt(k) / (Cmu^0.25 * L_mix)
//       = sqrt(0.295) / (0.09^0.25 * 0.02)
//       = 0.5431 / (0.5477 * 0.02)
//       = 49,580 s^-1
// L_mix = 0.02 m (1% of wingspan — free-stream mixing length estimate)
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 49400;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 49400;
    }

    outlet
    {
        type            zeroGradient;
    }

    farfield_top
    {
        type            freestream;
        freestreamValue uniform 49400;
    }

    farfield_bottom { $farfield_top; }
    farfield_sides  { $farfield_top; }

    uav_wall
    {
        type            omegaWallFunction;
        value           uniform 49400;
    }

    symmetryPlane
    {
        type            symmetryPlane;
    }
}
