openfoam/case_template_supersonic/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// ============================================================================

// rho = p / (R * T) = 12112 / (287 * 216.65) = 0.1948 kg/m3
// rhoCentralFoam updates this each timestep; this is just the initial condition
dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.1948;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.1948;
    }

    outlet
    {
        type            zeroGradient;
    }

    farfield_top
    {
        type            freestream;
        freestreamValue uniform 0.1948;
    }

    farfield_bottom { $farfield_top; }
    farfield_sides  { $farfield_top; }

    uav_wall
    {
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetryPlane;
    }
}
