openfoam/case_template_supersonic/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// ============================================================================

thermoType
{
    type            hePsiThermo;        // Compressible thermo using psi = 1/(RT)
    mixture         pureMixture;
    transport       sutherland;         // Sutherland viscosity law
    thermo          hConst;             // Constant Cp (valid for M~1.5 range)
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.96;          // Air [g/mol]
    }

    thermodynamics
    {
        Cp              1005;           // Specific heat at constant pressure [J/(kg K)]
        Hf              0;              // Heat of formation [J/kg] — zero for air
    }

    transport
    {
        // Sutherland law: mu = As * sqrt(T) / (1 + Ts/T)
        // Calibrated for dry air
        As              1.458e-06;      // [kg/(m s K^0.5)]
        Ts              110.4;          // Sutherland temperature [K]
    }
}
