openfoam/case_template_supersonic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// ============================================================================

application     rhoCentralFoam;

startFrom       latestTime;         // Resume from last checkpoint
startTime       0;
stopAt          endTime;
endTime         0.5;                // [s] Run until shockwaves stabilise
                                    // Typical convergence: 0.1–0.4 s physical time
                                    // Monitor postProcessing/forceCoeffs for plateau

deltaT          1e-7;               // Initial timestep — adjustableRunTime grows it
writeControl    adjustableRunTime;
writeInterval   0.01;               // Write every 10 ms (50 snapshots total)
purgeWrite      5;                  // Keep only 5 most recent time directories
writeFormat     binary;             // Faster I/O for large meshes
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable yes;

// ── Acoustic CFL control ──────────────────────────────────────────────────────
adjustTimeStep  yes;
maxCo           0.4;                // Acoustic CFL ≤ 0.5 required for shocks
maxDeltaT       1e-6;               // Hard cap on timestep

// ── Function objects ──────────────────────────────────────────────────────────
functions
{
    // ── Force coefficients: CL, CD, CM ────────────────────────────────────────
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   10;
        log             true;

        patches         (uav_wall);

        // Freestream reference values
        rho             rhoInf;
        rhoInf          0.1948;     // [kg/m3] ISA @ 15000 m
        pRef            12112;      // [Pa]    ISA @ 15000 m

        // Aerodynamic axes — zero AoA baseline (+X flow)
        liftDir         (0 1 0);    // +Y = lift direction
        dragDir         (1 0 0);    // +X = drag direction
        pitchAxis       (0 0 1);    // +Z = pitch moment axis

        // Reference geometry — ADJUST TO YOUR UAV
        CofR            (0.5 0.0 0.0);  // Centre of rotation / gravity [m]
        magUInf         442.6;          // Freestream speed [m/s]
        lRef            0.30;           // Reference chord length [m]
        Aref            0.60;           // Reference planform area [m2]
                                        // (full span; halve for half-body cases)
    }

    // ── Raw forces and moments ────────────────────────────────────────────────
    forces
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   10;
        log             true;

        patches         (uav_wall);
        rho             rhoInf;
        rhoInf          0.1948;
        pRef            12112;
        CofR            (0.5 0.0 0.0);
    }

    // ── Wall y+ ───────────────────────────────────────────────────────────────
    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (uav_wall);
    }

    // ── Mach number field ─────────────────────────────────────────────────────
    MachNo
    {
        type            MachNo;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    // ── Pressure coefficient field ────────────────────────────────────────────
    Cp
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        mode            pressureCoefficient;
        pInf            12112;
        UInf            (442.6 0 0);
        rhoInf          0.1948;
        writeControl    writeTime;
    }

    // ── Residual monitor ──────────────────────────────────────────────────────
    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (rho U p T k omega);
        writeControl    timeStep;
        writeInterval   1;
    }

    // ── Shock / flowfield probes ──────────────────────────────────────────────
    probeShock
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   50;
        fields          (p T rho MachNo U);

        // Place probes along stagnation streamline and spanwise shock cone
        // Adjust coordinates to match your UAV geometry
        probeLocations
        (
            ( 0.05  0.0   0.0)   // nose stagnation
            ( 0.50  0.0   0.0)   // fuselage midpoint
            ( 1.00  0.25  0.0)   // wing leading edge region
            ( 1.50  0.60  0.0)   // wing mid-chord
            ( 2.50  0.0   0.0)   // aft fuselage
            ( 4.00  0.0   0.0)   // near wake
            ( 8.00  0.0   0.0)   // far wake
            (-0.50  0.0   0.0)   // upstream (should stay at freestream)
        );
    }

    // ── Surface pressure sampling (for Cp distribution) ───────────────────────
    surfaceSampling
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   vtk;
        fields          (p Cp MachNo T);

        surfaces
        {
            uav_surface
            {
                type        patch;
                patches     (uav_wall);
                triangulate false;
            }

            // Symmetry-plane cut for shock structure visualisation
            sliceXY
            {
                type        cuttingPlane;
                planeType   pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0);
                    normal  (0 0 1);
                }
                interpolate true;
            }
        }
    }
}
