openfoam/case_template_supersonic/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: v2312                                  |
|   \\  /    A nd           | Web: www.openfoam.com                           |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// ============================================================================
// NOTE: rhoCentralFoam uses its own internal Kurganov-Tadmor (KT) central-upwind
// flux scheme for the main flow equations (rho, rhoU, rhoE).
// The schemes below apply only to the turbulence transport equations (k, omega).

ddtSchemes
{
    default         Euler;              // First-order time; sufficient for
                                        // marching to steady state
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    // Turbulence transport — limited upwind for boundedness
    div(phi,k)              Gauss linearUpwind grad(k);
    div(phi,omega)          Gauss linearUpwind grad(omega);

    // Viscous work term
    div(tauMC)              Gauss linear;

    // Turbulent kinetic energy convection
    div(phi,K)              Gauss linearUpwind default;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;

    // TVD reconstruction for the central solver — critical for sharp shocks
    reconstruct(rho)    vanLeer;        // Density
    reconstruct(U)      vanLeerV;       // Velocity (vector TVD)
    reconstruct(T)      vanLeer;        // Temperature
    reconstruct(p)      vanLeer;        // Pressure (derived quantity)
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}
